{
  "student_id": 518,
  "upload_id": 25,
  "school_id": "SCH003",
  "student_name": "",
  "class": "",
  "roll_number": "",
  "response_data": "{\"Forming expression from given context (notebook cost)\":\"M1\",\"Evaluating expression by substitution (total cost calculation)\":\"M2\",\"Modifying expression using percentage discount\":\"M3\",\"Addition and subtraction of integers in real-life (bank balance)\":\"M4\",\"Conversion between decimals and fractions\":\"M5\",\"Forming a linear equation from a word problem\":\"M6\",\"Comparing data using bar graph interpretation\":\"M7\",\"Identifying congruence criterion (SSS)\":\"M8\",\"Verifying triangle inequality rule\":\"M9\",\"Applying law of exponents for same base multiplication\":\"M10\",\"Writing a large number in exponential form\":\"M11\",\"Identifying trapezium by its defining property\":\"M12\",\"Distinguishing shapes based on side and diagonal properties (kite)\":\"M13\",\"Comparing diagonal properties (rectangle vs square)\":\"M14\",\"Reasoning congruence using RHS condition\":\"M15\",\"Identify main nutrients and their functions (carbohydrates, proteins, fats)\":\"S1\",\"Recognize the nature of substances using indicators (litmus, turmeric, phenolphthalein)\":\"S2\",\"Identify the process of obtaining silk and wool from animals (life cycle & shearing)\":\"S3\",\"Interpret uniform vs. non-uniform motion using a real-life graph.\":\"S4\",\"Differentiate between weather and climate; link to lifestyle or clothing\":\"S5\",\"Identify correct circuit symbol and predict bulb brightness in series connection\":\"S6\",\"Relate heating effect of current to devices like fuse or MCB\":\"S7\",\"Explain the formation of cyclones due to uneven heating of Earth\":\"S8\",\"Identify laws of reflection from a ray diagram or mirror example\":\"S9\",\"Compare images formed by concave and convex mirrors (size, orientation)\":\"S10\",\"Identify the type of nutrition (autotrophic, parasitic, saprophytic) with example\":\"S11\",\"Analyse difference between inhaled and exhaled air (oxygen & CO₂ content)\":\"S12\",\"Evaluate which pollination type occurs in given examples (wind, insect, self)\":\"S13\",\"Apply knowledge of dispersal agents (wind, water, animals) to real-life examples\":\"S14\",\"Evaluate effects of untreated sewage on health and environment (diseases, pollution)\":\"S15\",\"Retrieve and record information/identify key details from fiction and non-fiction.\":\"E1\",\"Comprehend literal information.\":\"E2\",\"Make inferences from the text/explain and justify inferences with evidence from the text.\":\"E3\",\"Summarise main ideas from more than one paragraph.\":\"E4\",\"Predict what might happen from details stated and implied.\":\"E5\",\"verb\":\"E6\",\"preposition\":\"E7\",\"punctutation\":\"E8\",\"Direct Speech\":\"E9\",\"idioms\":\"E10\",\"Summarise main ideas from more than one paragraph._1\":\"E11\",\"Give/explain the meaning of words in context.\":\"E12\",\"Make comparisons within the text.\":\"E13\",\"Identify/explain how information/narrative content is related and contributes to meanings as a whole.\":\"E14\",\"Identify/explain how meaning is enhanced through choice of words and phrases.\":\"E15\"}",
  "created_at": "2026-01-25 12:22:04"
}